choices_gender = [
    ('男', '男'),
    ('女', '女'),
]

choices_age = [
    ('15-16', '16歲以下'),
    ('16-18', '16-18歲'),
    ('18-29', '18-29歲'),
    ('30-44', '30-44歲'),
    ('45-65', '45-65歲'),
    ('65+', '65歲以上'),
]

choices_education = [
    ('未就學', '未就學'),
    ('小學', '小學'),
    ('國中', '國中'),
    ('高中', '高中'),
    ('高職', '高職'),
    ('專科', '專科'),
    ('大學', '大學'),
    ('碩士', '碩士'),
    ('博士', '博士'),
]

choices_identity = [
    ('無', '無'),
    ('非自願離職', '非自願離職'),
    ('中低收入戶', '中低收入戶 (含低收入戶)'),
    ('身心障礙', '身心障礙'),
    ('獨立負擔家計者', '獨立負擔家計者'),
    ('原住民', '原住民'),
    ('長期失業', '長期失業'),
    ('更生人', '更生人'),
    ('家暴被害人', '家暴被害人'),
    ('二度就業婦女', '二度就業婦女'),
    ('受災失業者', '受災失業者'),
    ('性侵害被害人', '性侵害被害人'),
    ('新住民', '新住民'),
]

choices_24_1 = {
    ('中低收入戶', '中低收入戶 (含低收入戶)'),
    ('身心障礙', '身心障礙'),
    ('獨立負擔家計者', '獨立負擔家計者'),
    ('原住民', '原住民'),
    ('長期失業', '長期失業'),
    ('更生人', '更生人'),
    ('家暴被害人', '家暴被害人'),
    ('二度就業婦女', '二度就業婦女'),
}

choices_current = [
    ('失業尋職中', '失業尋職中'),
    ('參訓無工作', '參訓無工作'),
    ('自由工作者', '自由工作者'),
    ('在職中', '在職中'),
    ('已退休待業中', '已退休待業中'),
    ('學生', '學生'),
]

choices_unemployment_duration = [
    ('0-14', '未滿14天'),
    ('15-29', '15-29天'),
    ('30-89', '30-89天'),
    ('90-179', '90-179天'),
    ('180+', '180天以上'),
]

choices_anticipation = [
    ('Catering', '餐飲業'),
    ('Tourism', '觀光旅遊業'),
    ('Ground', '航空地勤業'),
    ('Nursing assistant', '照顧服務業'),
    ('Manufacturing', '製造業'),
    ('Construction', '營造業'),
]
