choices_current = [
    ('unemployed', '待業中'),
    ('training', '職訓中'),
    ('employed', '就業中'),
    ('retired', '退休'),
    ('student', '學生'),
    ('freelancer', '自由工作者'),
]

choices_division = [
    ('綜合規劃科', '綜合規劃科'),
    ('自辦訓練科', '自辦訓練科'),
    ('創客基地', '創客基地'),
    ('就業促進科', '就業促進科'),
    ('訓練推廣科', '訓練推廣科'),
    ('特定對象及學員輔導科', '特定對象及學員輔導科'),
    ('諮詢服務及給付科', '諮詢服務及給付科'),
    ('銀髮人才資源中心', '銀髮人才資源中心'),
    ('青年職涯發展中心', '青年職涯發展中心'),
    ('產學培力中心', '產學培力中心'),
]

choices_gender = [
    ('Male', '男'),
    ('Female', '女'),
    ('', '不限'),
]

choices_age = [
    ('15-16', '16歲以下'),
    ('16-18', '16-18歲'),
    ('18-29', '18-29歲'),
    ('30-44', '30-44歲'),
    ('45-65', '45-65歲'),
    ('65+', '65歲以上'),
    ('', '不限'),
]

choices_identity = [
    ('None', '無'),
    ('Laidoff', '非自願離職'),
    ('Lowincome', '中低收入戶 (含低收入戶)'),
    ('Disability', '身心障礙'),
    ('Aboriginal', '原住民'),
    ('Longterm', '長期失業'),
    ('rehabilitation', '更生人'),
    ('Singleparent', '單親'),
    ('Abused', '家暴被害人'),
    ('Sexuallyabused', '性侵害被害人'),
    ('Newimmigrant', '新住民'),
    ('Rejoinwomen', '二度就業婦女'),
    ('Disaster', '受災失業者'),
]

choices_unemployment_duration = [
    ('0-14', '未滿14天'),
    ('15-29', '15-29天'),
    ('30-59', '30-59天'),
    ('60-89', '60-89天'),
    ('90+', '90天以上'),
]
